heat-sim-heaters/system/BlenderMeshes/system/snappyHexMeshDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          snappyHexMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: /home/basta/Documents/bakalarka/bakalarka-openfoam/heat-sim-heaters/model.blend
// Export date: 2024-10-23 23:31:51.561951

// Details about SnappyHexMesh parameters can be found in annotated caseDicts:
// - For openfoam.org (development version), see
//   https://github.com/OpenFOAM/OpenFOAM-dev/blob/master/etc/caseDicts/annotated/snappyHexMeshDict
// - For openfoam.com (development version), see
//   https://develop.openfoam.com/Development/openfoam/-/blob/master/etc/caseDicts/annotated/snappyHexMeshDict
// See also links in https://openfoamwiki.net/index.php/SnappyHexMesh

castellatedMesh true;
snap            true;
addLayers       false;

mergePatchFaces false;  // Avoid face merging to increase layer coverage

geometry
{
    Cylinder
    {
        type triSurfaceMesh;
        file "Cylinder.stl";
        // Min Bounds = [-2.00000e+01 -2.00000e+01 -5.00000e+00]
        // Max Bounds = [ 2.00000e+01  2.00000e+01  5.00000e+00]
        // Area = 3.88769e+03
    }
}

castellatedMeshControls
{
    maxLocalCells   100000;
    maxGlobalCells  10000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.1;
    nCellsBetweenLevels 4;
    locationInMesh (0 0 0);
    allowFreeStandingZoneFaces true;
    resolveFeatureAngle 30;
    // useLeakClosure true; // OpenFOAM.com option
    handleSnapProblems true;
    useTopologicalSnapDetection true;

    features
    (
        {
            file "Cylinder.eMesh";
            level 0;
        }

    );

    refinementSurfaces
    {
        Cylinder
        {
            level (0 0);
            patchInfo { type patch; }
        }

    }

    refinementRegions
    {

    }
}

snapControls
{
    nSmoothPatch 2;
    nSmoothInternal 1; // OpenFOAM.com option
    tolerance 2.0;
    nSolveIter 4;
    nRelaxIter 5;
    nFeatureSnapIter 3;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
    nFaceSplitInterval -1; // OpenFOAM.com option
    releasePoints false;  // multi-region related option
    stringFeatures true;
    avoidDiagonal false;
    strictRegionSnap false;
    concaveAngle 45;
    minAreaRatio 0.3;
}

addLayersControls
{
    // Layer sizing
    relativeSizes true;
    expansionRatio 1.3;
    finalLayerThickness 0.6;
    minThickness 0.001;
    nGrow 0;

    // Mesh dependencies
    featureAngle 85;
    mergePatchFacesAngle 45; // OpenFOAM.com option
    layerTerminationAngle 45; // OpenFOAM.com option
    maxFaceThicknessRatio 0.5;
    disableWallEdges false;

    // Mesh displacement iterations
    nSmoothSurfaceNormals 8;
    nSmoothThickness 2;
    nSmoothNormals 0;
    nSmoothDisplacement 12;
    nMedialAxisIter 1000;

    // Medial axis analysis
    minMedialAxisAngle 90;
    maxThicknessToMedialRatio 0.5;
    slipFeatureAngle 30;
    nRelaxIter 10;

    // OpenFOAM.com displacement motion solver
    // meshShrinker displacementMotionSolver;
    // solver displacementLaplacian;
    // displacementLaplacianCoeffs { diffusivity quadratic inverseDistance ("wall.*"); }

    // Mesh shrinking overall settings
    nBufferCellsNoExtrude 0;
    nLayerIter 8;
    nRelaxedIter 0;
    nOuterIter 1000; // OpenFOAM.com option, 1=single pass layer addition
    additionalReporting true;

    layers
    {

    }
}

meshQualityControls
{
    nSmoothScale    4;
    errorReduction  0.75;
    #include "meshQualityDict"
}

writeFlags      ( scalarLevels layerSets layerFields );

mergeTolerance  1e-06;
