heat-sim-heaters/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1806/v10                             |
|   \  /    A nd           | Web:      https://www.OpenFOAM.com              |
|    \/     M anipulation  |           https://www.OpenFOAM.org              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
	(0.00000000 0.00000000 0.00000000) // 0
	(0.00000000 0.00000000 7.00000000) // 1
	(0.00000000 -5.47673875 5.47673875) // 2
	(0.00000000 -7.00000000 0.00000000) // 3
	(5.00000000 0.00000000 0.00000000) // 4
	(5.00000000 0.00000000 7.00000000) // 5
	(5.00000000 -5.47673875 5.47673875) // 6
	(5.00000000 -7.00000000 0.00000000) // 7
	(0.00000000 -0.00000000 -7.00000000) // 8
	(0.00000000 -5.47673875 -5.47673875) // 9
	(5.00000000 -0.00000000 -7.00000000) // 10
	(5.00000000 -5.47673875 -5.47673875) // 11
	(0.00000000 5.47673875 -5.47673875) // 12
	(0.00000000 7.00000000 -0.00000000) // 13
	(5.00000000 5.47673875 -5.47673875) // 14
	(5.00000000 7.00000000 -0.00000000) // 15
	(0.00000000 5.47673875 5.47673875) // 16
	(5.00000000 5.47673875 5.47673875) // 17
	(0.00000000 0.00000000 10.00000000) // 18
	(0.00000000 -7.07106781 7.07106781) // 19
	(5.00000000 0.00000000 10.00000000) // 20
	(5.00000000 -7.07106781 7.07106781) // 21
	(0.00000000 -10.00000000 0.00000000) // 22
	(5.00000000 -10.00000000 0.00000000) // 23
	(0.00000000 -7.07106781 -7.07106781) // 24
	(5.00000000 -7.07106781 -7.07106781) // 25
	(0.00000000 -0.00000000 -10.00000000) // 26
	(5.00000000 -0.00000000 -10.00000000) // 27
	(0.00000000 7.07106781 -7.07106781) // 28
	(5.00000000 7.07106781 -7.07106781) // 29
	(0.00000000 10.00000000 -0.00000000) // 30
	(5.00000000 10.00000000 -0.00000000) // 31
	(0.00000000 7.07106781 7.07106781) // 32
	(5.00000000 7.07106781 7.07106781) // 33
);

blocks
(
	hex ( 0 1 2 3 4 5 6 7 )  ( 5 5 4 ) simpleGrading ( 1.0 1 2.0 ) // 0 
	hex ( 8 0 3 9 10 4 7 11 )  ( 5 5 4 ) simpleGrading ( 1.0 1 2.0 ) // 1 
	hex ( 12 13 0 8 14 15 4 10 )  ( 5 5 4 ) simpleGrading ( 1.0 1.0 2.0 ) // 2 
	hex ( 13 16 1 0 15 17 5 4 )  ( 5 5 4 ) simpleGrading ( 1.0 1.0 2.0 ) // 3 
	hex ( 1 18 19 2 5 20 21 6 )  ( 5 5 4 ) simpleGrading ( 32.777845240402655 1 2.0 ) // 4 
	hex ( 2 19 22 3 6 21 23 7 )  ( 5 5 4 ) simpleGrading ( 32.777845240402655 1 2.0 ) // 5 
	hex ( 3 22 24 9 7 23 25 11 )  ( 5 5 4 ) simpleGrading ( 32.777845240402655 1 2.0 ) // 6 
	hex ( 9 24 26 8 11 25 27 10 )  ( 5 5 4 ) simpleGrading ( 32.777845240402655 1.0 2.0 ) // 7 
	hex ( 8 26 28 12 10 27 29 14 )  ( 5 5 4 ) simpleGrading ( 32.777845240402655 1 2.0 ) // 8 
	hex ( 12 28 30 13 14 29 31 15 )  ( 5 5 4 ) simpleGrading ( 32.777845240402655 1.0 2.0 ) // 9 
	hex ( 13 30 32 16 15 31 33 17 )  ( 5 5 4 ) simpleGrading ( 32.777845240402655 1.0 2.0 ) // 10 
	hex ( 16 32 18 1 17 33 20 5 )  ( 5 5 4 ) simpleGrading ( 32.777845240402655 1.0 2.0 ) // 11 
);

edges
(
	spline 1 2 ((0.00000000 -0.98235375 6.93021875) (0.00000000 -1.94655125 6.67263625) (0.00000000 -2.85855500 6.34371500) (0.00000000 -3.68529875 6.00701500) (0.00000000 -4.39316500 5.70762500) (0.00000000 -4.95710250 5.47673875))
	spline 2 3 ((0.00000000 -5.47673875 4.95710250) (0.00000000 -5.70762500 4.39316500) (0.00000000 -6.00701500 3.68529875) (0.00000000 -6.34371500 2.85855500) (0.00000000 -6.67263625 1.94655125) (0.00000000 -6.93021875 0.98235375))
	spline 5 6 ((5.00000000 -0.98235375 6.93021875) (5.00000000 -1.94655125 6.67263625) (5.00000000 -2.85855500 6.34371500) (5.00000000 -3.68529875 6.00701500) (5.00000000 -4.39316500 5.70762500) (5.00000000 -4.95710250 5.47673875))
	spline 6 7 ((5.00000000 -5.47673875 4.95710250) (5.00000000 -5.70762500 4.39316500) (5.00000000 -6.00701500 3.68529875) (5.00000000 -6.34371500 2.85855500) (5.00000000 -6.67263625 1.94655125) (5.00000000 -6.93021875 0.98235375))
	spline 8 9 ((0.00000000 -0.98235375 -6.93021875) (0.00000000 -1.94655125 -6.67263625) (0.00000000 -2.85855500 -6.34371500) (0.00000000 -3.68529875 -6.00701500) (0.00000000 -4.39316500 -5.70762500) (0.00000000 -4.95710250 -5.47673875))
	spline 3 9 ((0.00000000 -6.93021875 -0.98235375) (0.00000000 -6.67263625 -1.94655125) (0.00000000 -6.34371500 -2.85855500) (0.00000000 -6.00701500 -3.68529875) (0.00000000 -5.70762500 -4.39316500) (0.00000000 -5.47673875 -4.95710250))
	spline 10 11 ((5.00000000 -0.98235375 -6.93021875) (5.00000000 -1.94655125 -6.67263625) (5.00000000 -2.85855500 -6.34371500) (5.00000000 -3.68529875 -6.00701500) (5.00000000 -4.39316500 -5.70762500) (5.00000000 -4.95710250 -5.47673875))
	spline 7 11 ((5.00000000 -6.93021875 -0.98235375) (5.00000000 -6.67263625 -1.94655125) (5.00000000 -6.34371500 -2.85855500) (5.00000000 -6.00701500 -3.68529875) (5.00000000 -5.70762500 -4.39316500) (5.00000000 -5.47673875 -4.95710250))
	spline 12 13 ((0.00000000 5.47673875 -4.95710250) (0.00000000 5.70762500 -4.39316500) (0.00000000 6.00701500 -3.68529875) (0.00000000 6.34371500 -2.85855500) (0.00000000 6.67263625 -1.94655125) (0.00000000 6.93021875 -0.98235375))
	spline 12 8 ((0.00000000 4.95710250 -5.47673875) (0.00000000 4.39316500 -5.70762500) (0.00000000 3.68529875 -6.00701500) (0.00000000 2.85855500 -6.34371500) (0.00000000 1.94655125 -6.67263625) (0.00000000 0.98235375 -6.93021875))
	spline 14 15 ((5.00000000 5.47673875 -4.95710250) (5.00000000 5.70762500 -4.39316500) (5.00000000 6.00701500 -3.68529875) (5.00000000 6.34371500 -2.85855500) (5.00000000 6.67263625 -1.94655125) (5.00000000 6.93021875 -0.98235375))
	spline 14 10 ((5.00000000 4.95710250 -5.47673875) (5.00000000 4.39316500 -5.70762500) (5.00000000 3.68529875 -6.00701500) (5.00000000 2.85855500 -6.34371500) (5.00000000 1.94655125 -6.67263625) (5.00000000 0.98235375 -6.93021875))
	spline 13 16 ((0.00000000 6.93021875 0.98235375) (0.00000000 6.67263625 1.94655125) (0.00000000 6.34371500 2.85855500) (0.00000000 6.00701500 3.68529875) (0.00000000 5.70762500 4.39316500) (0.00000000 5.47673875 4.95710250))
	spline 16 1 ((0.00000000 4.95710250 5.47673875) (0.00000000 4.39316500 5.70762500) (0.00000000 3.68529875 6.00701500) (0.00000000 2.85855500 6.34371500) (0.00000000 1.94655125 6.67263625) (0.00000000 0.98235375 6.93021875))
	spline 15 17 ((5.00000000 6.93021875 0.98235375) (5.00000000 6.67263625 1.94655125) (5.00000000 6.34371500 2.85855500) (5.00000000 6.00701500 3.68529875) (5.00000000 5.70762500 4.39316500) (5.00000000 5.47673875 4.95710250))
	spline 17 5 ((5.00000000 4.95710250 5.47673875) (5.00000000 4.39316500 5.70762500) (5.00000000 3.68529875 6.00701500) (5.00000000 2.85855500 6.34371500) (5.00000000 1.94655125 6.67263625) (5.00000000 0.98235375 6.93021875))
	// arc 18 19 origin 1 (0.00000000 0.00000000 0.00000000)
	arc 18 19 (0.00000000 -3.82683432 9.23879533)
	// arc 20 21 origin 1 (5.00000000 0.00000000 0.00000000)
	arc 20 21 (5.00000000 -3.82683432 9.23879533)
	// arc 19 22 origin 1 (0.00000000 0.00000000 0.00000000)
	arc 19 22 (0.00000000 -9.23879533 3.82683432)
	// arc 21 23 origin 1 (5.00000000 0.00000000 0.00000000)
	arc 21 23 (5.00000000 -9.23879533 3.82683432)
	// arc 22 24 origin 1 (0.00000000 0.00000000 0.00000000)
	arc 22 24 (0.00000000 -9.23879533 -3.82683432)
	// arc 23 25 origin 1 (5.00000000 0.00000000 0.00000000)
	arc 23 25 (5.00000000 -9.23879533 -3.82683432)
	// arc 24 26 origin 1 (0.00000000 0.00000000 0.00000000)
	arc 24 26 (0.00000000 -3.82683432 -9.23879533)
	// arc 25 27 origin 1 (5.00000000 0.00000000 0.00000000)
	arc 25 27 (5.00000000 -3.82683432 -9.23879533)
	// arc 26 28 origin 1 (0.00000000 0.00000000 0.00000000)
	arc 26 28 (0.00000000 3.82683432 -9.23879533)
	// arc 27 29 origin 1 (5.00000000 0.00000000 0.00000000)
	arc 27 29 (5.00000000 3.82683432 -9.23879533)
	// arc 28 30 origin 1 (0.00000000 0.00000000 0.00000000)
	arc 28 30 (0.00000000 9.23879533 -3.82683432)
	// arc 29 31 origin 1 (5.00000000 0.00000000 0.00000000)
	arc 29 31 (5.00000000 9.23879533 -3.82683432)
	// arc 30 32 origin 1 (0.00000000 0.00000000 0.00000000)
	arc 30 32 (0.00000000 9.23879533 3.82683432)
	// arc 31 33 origin 1 (5.00000000 0.00000000 0.00000000)
	arc 31 33 (5.00000000 9.23879533 3.82683432)
	// arc 32 18 origin 1 (0.00000000 0.00000000 0.00000000)
	arc 32 18 (0.00000000 3.82683432 9.23879533)
	// arc 33 20 origin 1 (5.00000000 0.00000000 0.00000000)
	arc 33 20 (5.00000000 3.82683432 9.23879533)
);

faces
(
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 1 2 3)
			(8 0 3 9)
			(12 13 0 8)
			(13 16 1 0)
			(1 18 19 2)
			(2 19 22 3)
			(3 22 24 9)
			(9 24 26 8)
			(8 26 28 12)
			(12 28 30 13)
			(13 30 32 16)
			(16 32 18 1)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(4 5 6 7)
			(10 4 7 11)
			(14 15 4 10)
			(15 17 5 4)
			(5 20 21 6)
			(6 21 23 7)
			(7 23 25 11)
			(11 25 27 10)
			(10 27 29 14)
			(14 29 31 15)
			(15 31 33 17)
			(17 33 20 5)
		);
	}
	wall
	{
		type patch;
		faces
		(
			(20 18 19 21)
			(21 19 22 23)
			(23 22 24 25)
			(25 24 26 27)
			(27 26 28 29)
			(29 28 30 31)
			(31 30 32 33)
			(33 32 18 20)
		);
	}
);

mergePatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Created with classy_blocks: https://github.com/damogranlabs/classy_blocks //
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
