heat-sim-heaters/system/BlenderMeshes/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: /home/basta/Documents/bakalarka/bakalarka-openfoam/heat-sim-heaters/model.blend
// Export date: 2024-10-23 23:31:51.561787

numberOfSubdomains 1;

method          scotch;
// method          simple;

simpleCoeffs
{
    n               (1 1 1);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (1 1 1);
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}
