heat-sim-heaters/system/system/meshQualityDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          snappyHexMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: /home/basta/Documents/bakalarka/bakalarka-openfoam/heat-sim-heaters/model.blend
// Export date: 2024-10-23 23:26:52.742069

maxNonOrtho     35;
maxBoundarySkewness 2.0;
maxInternalSkewness 1.5;
maxConcave      30;
minVol          1e-15;
minTetQuality   1e-15;
minArea         1e-30;
minTwist        0.05;
minDeterminant  0.001;
minFaceWeight   0.05;
minVolRatio     0.05;
minTriangleTwist 0.6;

// Relaxed quality criteria for layer addition phase

relaxed {
    maxNonOrtho 65;
}
